; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=6, packages=13, locations=14, max_capacity=2, out_folder=training/easy, instance_id=75, seed=116

(define (problem transport-75)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l5)
    (at p3 l7)
    (at p4 l10)
    (at p5 l7)
    (at p6 l14)
    (at p7 l10)
    (at p8 l2)
    (at p9 l8)
    (at p10 l2)
    (at p11 l6)
    (at p12 l13)
    (at p13 l9)
    (at v1 l6)
    (at v2 l8)
    (at v3 l1)
    (at v4 l9)
    (at v5 l13)
    (at v6 l9)
    (road l12 l1)
    (road l14 l4)
    (road l12 l10)
    (road l4 l9)
    (road l12 l13)
    (road l14 l10)
    (road l9 l2)
    (road l5 l13)
    (road l3 l13)
    (road l13 l5)
    (road l10 l12)
    (road l13 l11)
    (road l1 l12)
    (road l6 l14)
    (road l14 l6)
    (road l4 l14)
    (road l8 l5)
    (road l9 l4)
    (road l10 l14)
    (road l11 l13)
    (road l5 l8)
    (road l8 l7)
    (road l13 l3)
    (road l2 l9)
    (road l13 l12)
    (road l7 l8)
    (road l2 l6)
    (road l6 l2)
    (road l11 l14)
    (road l14 l11)
    (road l4 l5)
    (road l5 l4)
    (road l3 l4)
    (road l4 l3)
    (road l8 l12)
    (road l12 l8)
    (road l2 l11)
    (road l11 l2)
    (road l1 l9)
    (road l9 l1)
    (road l11 l12)
    (road l12 l11)
    (road l10 l11)
    (road l11 l10)
    (road l1 l2)
    (road l2 l1)
    (road l10 l13)
    (road l13 l10)
    (road l2 l3)
    (road l3 l2)
    (road l6 l7)
    (road l7 l6)
    )
 (:goal  (and 
    (at p1 l3)
    (at p2 l12)
    (at p3 l6)
    (at p4 l11)
    (at p5 l5)
    (at p6 l7)
    (at p7 l9)
    (at p8 l9)
    (at p9 l1)
    (at p10 l9)
    (at p11 l14)
    (at p12 l3)
    (at p13 l1))))

; plan
1. (drive v1 l6 l14)
   deleted: (at v1 l6)
   added: (at v1 l14)
   goals met: 0 of 13
2. (drive v1 l14 l4)
   deleted: (at v1 l14)
   added: (at v1 l4)
   goals met: 0 of 13
3. (pick-up v1 l4 p1 c1 c2)
   deleted: (at p1 l4) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 13
4. (drive v1 l4 l3)
   deleted: (at v1 l4)
   added: (at v1 l3)
   goals met: 0 of 13
5. (drop v1 l3 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l3) (capacity v1 c2)
   goals met: 1 of 13
6. (drive v1 l3 l13)
   deleted: (at v1 l3)
   added: (at v1 l13)
   goals met: 1 of 13
7. (drive v1 l13 l5)
   deleted: (at v1 l13)
   added: (at v1 l5)
   goals met: 1 of 13
8. (pick-up v1 l5 p2 c1 c2)
   deleted: (at p2 l5) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 1 of 13
9. (drive v1 l5 l13)
   deleted: (at v1 l5)
   added: (at v1 l13)
   goals met: 1 of 13
10. (drive v1 l13 l12)
   deleted: (at v1 l13)
   added: (at v1 l12)
   goals met: 1 of 13
11. (drop v1 l12 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l12) (capacity v1 c2)
   goals met: 2 of 13
12. (drive v1 l12 l8)
   deleted: (at v1 l12)
   added: (at v1 l8)
   goals met: 2 of 13
13. (drive v1 l8 l7)
   deleted: (at v1 l8)
   added: (at v1 l7)
   goals met: 2 of 13
14. (pick-up v1 l7 p3 c1 c2)
   deleted: (at p3 l7) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 2 of 13
15. (drive v1 l7 l6)
   deleted: (at v1 l7)
   added: (at v1 l6)
   goals met: 2 of 13
16. (drop v1 l6 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l6) (capacity v1 c2)
   goals met: 3 of 13
17. (drive v1 l6 l14)
   deleted: (at v1 l6)
   added: (at v1 l14)
   goals met: 3 of 13
18. (drive v1 l14 l10)
   deleted: (at v1 l14)
   added: (at v1 l10)
   goals met: 3 of 13
19. (pick-up v1 l10 p4 c1 c2)
   deleted: (at p4 l10) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 3 of 13
20. (drive v1 l10 l11)
   deleted: (at v1 l10)
   added: (at v1 l11)
   goals met: 3 of 13
21. (drop v1 l11 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l11) (capacity v1 c2)
   goals met: 4 of 13
22. (drive v1 l11 l14)
   deleted: (at v1 l11)
   added: (at v1 l14)
   goals met: 4 of 13
23. (drive v1 l14 l6)
   deleted: (at v1 l14)
   added: (at v1 l6)
   goals met: 4 of 13
24. (drive v1 l6 l7)
   deleted: (at v1 l6)
   added: (at v1 l7)
   goals met: 4 of 13
25. (pick-up v1 l7 p5 c1 c2)
   deleted: (at p5 l7) (capacity v1 c2)
   added: (in p5 v1) (capacity v1 c1)
   goals met: 4 of 13
26. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 4 of 13
27. (drive v1 l8 l5)
   deleted: (at v1 l8)
   added: (at v1 l5)
   goals met: 4 of 13
28. (drop v1 l5 p5 c1 c2)
   deleted: (in p5 v1) (capacity v1 c1)
   added: (at p5 l5) (capacity v1 c2)
   goals met: 5 of 13
29. (drive v1 l5 l4)
   deleted: (at v1 l5)
   added: (at v1 l4)
   goals met: 5 of 13
30. (drive v1 l4 l14)
   deleted: (at v1 l4)
   added: (at v1 l14)
   goals met: 5 of 13
31. (pick-up v1 l14 p6 c1 c2)
   deleted: (at p6 l14) (capacity v1 c2)
   added: (in p6 v1) (capacity v1 c1)
   goals met: 5 of 13
32. (drive v1 l14 l6)
   deleted: (at v1 l14)
   added: (at v1 l6)
   goals met: 5 of 13
33. (drive v1 l6 l7)
   deleted: (at v1 l6)
   added: (at v1 l7)
   goals met: 5 of 13
34. (drop v1 l7 p6 c1 c2)
   deleted: (in p6 v1) (capacity v1 c1)
   added: (at p6 l7) (capacity v1 c2)
   goals met: 6 of 13
35. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 6 of 13
36. (drive v1 l8 l12)
   deleted: (at v1 l8)
   added: (at v1 l12)
   goals met: 6 of 13
37. (drive v1 l12 l10)
   deleted: (at v1 l12)
   added: (at v1 l10)
   goals met: 6 of 13
38. (pick-up v1 l10 p7 c1 c2)
   deleted: (at p7 l10) (capacity v1 c2)
   added: (in p7 v1) (capacity v1 c1)
   goals met: 6 of 13
39. (drive v1 l10 l12)
   deleted: (at v1 l10)
   added: (at v1 l12)
   goals met: 6 of 13
40. (drive v1 l12 l1)
   deleted: (at v1 l12)
   added: (at v1 l1)
   goals met: 6 of 13
41. (drive v1 l1 l9)
   deleted: (at v1 l1)
   added: (at v1 l9)
   goals met: 6 of 13
42. (drop v1 l9 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l9) (capacity v1 c2)
   goals met: 7 of 13
43. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 7 of 13
44. (pick-up v1 l2 p8 c1 c2)
   deleted: (at p8 l2) (capacity v1 c2)
   added: (in p8 v1) (capacity v1 c1)
   goals met: 7 of 13
45. (drive v1 l2 l9)
   deleted: (at v1 l2)
   added: (at v1 l9)
   goals met: 7 of 13
46. (drop v1 l9 p8 c1 c2)
   deleted: (in p8 v1) (capacity v1 c1)
   added: (at p8 l9) (capacity v1 c2)
   goals met: 8 of 13
47. (drive v1 l9 l4)
   deleted: (at v1 l9)
   added: (at v1 l4)
   goals met: 8 of 13
48. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 8 of 13
49. (drive v1 l5 l8)
   deleted: (at v1 l5)
   added: (at v1 l8)
   goals met: 8 of 13
50. (pick-up v1 l8 p9 c1 c2)
   deleted: (at p9 l8) (capacity v1 c2)
   added: (in p9 v1) (capacity v1 c1)
   goals met: 8 of 13
51. (drive v1 l8 l12)
   deleted: (at v1 l8)
   added: (at v1 l12)
   goals met: 8 of 13
52. (drive v1 l12 l1)
   deleted: (at v1 l12)
   added: (at v1 l1)
   goals met: 8 of 13
53. (drop v1 l1 p9 c1 c2)
   deleted: (in p9 v1) (capacity v1 c1)
   added: (at p9 l1) (capacity v1 c2)
   goals met: 9 of 13
54. (drive v1 l1 l2)
   deleted: (at v1 l1)
   added: (at v1 l2)
   goals met: 9 of 13
55. (pick-up v1 l2 p10 c1 c2)
   deleted: (at p10 l2) (capacity v1 c2)
   added: (in p10 v1) (capacity v1 c1)
   goals met: 9 of 13
56. (drive v1 l2 l9)
   deleted: (at v1 l2)
   added: (at v1 l9)
   goals met: 9 of 13
57. (drop v1 l9 p10 c1 c2)
   deleted: (in p10 v1) (capacity v1 c1)
   added: (at p10 l9) (capacity v1 c2)
   goals met: 10 of 13
58. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 10 of 13
59. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 10 of 13
60. (pick-up v1 l6 p11 c1 c2)
   deleted: (at p11 l6) (capacity v1 c2)
   added: (in p11 v1) (capacity v1 c1)
   goals met: 10 of 13
61. (drive v1 l6 l14)
   deleted: (at v1 l6)
   added: (at v1 l14)
   goals met: 10 of 13
62. (drop v1 l14 p11 c1 c2)
   deleted: (in p11 v1) (capacity v1 c1)
   added: (at p11 l14) (capacity v1 c2)
   goals met: 11 of 13
63. (drive v1 l14 l10)
   deleted: (at v1 l14)
   added: (at v1 l10)
   goals met: 11 of 13
64. (drive v1 l10 l13)
   deleted: (at v1 l10)
   added: (at v1 l13)
   goals met: 11 of 13
65. (pick-up v1 l13 p12 c1 c2)
   deleted: (at p12 l13) (capacity v1 c2)
   added: (in p12 v1) (capacity v1 c1)
   goals met: 11 of 13
66. (drive v1 l13 l3)
   deleted: (at v1 l13)
   added: (at v1 l3)
   goals met: 11 of 13
67. (drop v1 l3 p12 c1 c2)
   deleted: (in p12 v1) (capacity v1 c1)
   added: (at p12 l3) (capacity v1 c2)
   goals met: 12 of 13
68. (drive v1 l3 l4)
   deleted: (at v1 l3)
   added: (at v1 l4)
   goals met: 12 of 13
69. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 12 of 13
70. (pick-up v1 l9 p13 c1 c2)
   deleted: (at p13 l9) (capacity v1 c2)
   added: (in p13 v1) (capacity v1 c1)
   goals met: 12 of 13
71. (drive v1 l9 l1)
   deleted: (at v1 l9)
   added: (at v1 l1)
   goals met: 12 of 13
72. (drop v1 l1 p13 c1 c2)
   deleted: (in p13 v1) (capacity v1 c1)
   added: (at p13 l1) (capacity v1 c2)
   goals met: 13 of 13
